In [7]:
import pandas as pd
import glob

In [8]:
file=glob.glob("4week*")

In [16]:
print(file)

['4week-feb.xlsx', '4week-jan.xlsx', '4week-mar.xlsx']

In [13]:
def combineSheet(fileName):
    df = pd.concat(pd.read_excel(fileName, sheet_name=None), ignore_index=True)
    return df

In [14]:
all_data = pd.DataFrame()
for f in file:
    df = combineSheet(f)
    all_data = all_data.append(df,ignore_index=True)

In [17]:
all_data.describe()

               id        type        cost
count  240.000000  240.000000  240.000000
mean    10.500000    4.675000   64.375000
std      5.778332    2.692505   20.741914
min      1.000000    1.000000   33.000000
25%      5.750000    2.000000   45.750000
50%     10.500000    5.000000   65.500000
75%     15.250000    7.000000   81.250000
max     20.000000    9.000000   99.000000

In [18]:
all_data.head(3)

   id  type  cost
0   1     4    80
1   2     9    42
2   3     2    98

In [19]:
all_data.tail(3)

     id  type  cost
237  18     1    65
238  19     3    37
239  20     9    80